using System;
using System.Collections.Generic;
using System.Text;

namespace Davaleba6
{
    class Klasi2
    {
        private int[][] massivex2 = { };
        int jami = 0;

        public Klasi2(int[][] massivex2)
        {
            this.massivex2 = massivex2;
        }
        public int Jami(Klasi2 klasi2)
        {
            foreach (var massivex1 in massivex2)
            {
                foreach (int number in massivex1)
                {
                    if (number%2==0)
                    {
                        jami += number;
                    }
                }
            }
            return jami;
        }
    }
}
/*შექმენით კლასი. მასში გამოაცხადეთ პრივატული წევრები: ორგანზომილებიანი
მთელი ტიპის მასივზე მიმართვა და ცვლადი ამ მასივის ლუწი ელემენტების
ჯამის შესანახად. გამოაცხადეთ ღია მეთოდები: კონსტრუქტორი, რომელიც
ახდენს მასივის ინიციალიზებას; Jami() მეთოდი, რომელსაც პარამეტრად
გადაეცემა ამავე კლასის ობიექტი. მეთოდი ამ ობიექტში გამოცხადებული
მასივისთვის გამოთვლის და დააბრუნებს ლუწი ელემენტების ჯამს. ძირითად
პროგრამაში გამოაცხადეთ სამი ორგანზომილებიანი მთელი ტიპის მასივი.
შექმენით სამი ობიექტი: პირველი ობიექტის შექმნისას კონსტრუქტორს გადაეცით
პირველი მასივი, მეორე ობიექტის შექმნისას კონსტრუქტორს გადაეცით მეორე
მასივი და მესამე ობიექტის შექმნისას კონსტრუქტორს გადაეცით მესამე მასივი.
შემდეგ, პირველი ობიექტიდან გამოიძახეთ Jami() მეთოდი და პარამეტრად
გადაეცით პირველივე ობიექტი; პირველი ობიექტიდან გამოიძახეთ Jami()
მეთოდი და პარამეტრად გადაეცით მეორე ობიექტი; მეორე ობიექტიდან
გამოიძახეთ Jami() მეთოდი და პარამეტრად გადაეცით მესამე ობიექტი; მესამე
ობიექტიდან გამოიძახეთ Jami() მეთოდი და პარამეტრად გადაეცით პირველი
ობიექტი. შედეგები გამოიტანეთ Label ვიზუალურ ელემენტებში.*/